<?php
//25. Ваше задание создать массив, наполнить это случайными значениями (функция rand),
// найти максимальное и минимальное значение и поменять их местами.

$arr = [0];

$j = 0;
while ($j < 20) {
    $arr[$j] = rand(0, 1000);
    $j++;
}

$max = -INF; //  Максимальное число = отрицательная бесконечность
$min =  INF; //  Минимотное число = положительная бесконечность

foreach ($arr as $k) {
    if ($k > $max) {
        $max = $k;
    }
    if ($k < $min) {
        $min = $k;
    }
}

echo "max: $max, min: $min";

?>