<?php
/**
 * 15. Написать калькулятор. Переменная $a = изменяемое число. Переменная $b = изменяемое число.
 * Переменная $operator = ‘+’ или ‘-’ или ‘/’ или ‘*’ или '%' (остаток от деления).
 * На экран выводить результат в зависимости от значений этих переменных.
 * Не забудьте про деление на 0, если надо - выдавать ошибку что на 0 делить нельзя.
 */

$a = 15;
$b = 23;

$operator =  '/';
// '+';
// '-';
// '/';
// '*';
// '%';

switch ($operator) {
    case '+':
        echo '$a '.$operator.' $b = ',$a + $b;
        break;
    case '-':
        echo '$a '.$operator.' $b = ', $a - $b;
        break;
    case '/':
        if ($b != 0)
        echo '$a '.$operator.' $b = ', $a / $b;
        else
            echo 'Делить на 0 нельзя!';
        break;
    case '*':
        echo '$a '.$operator.' $b = ', $a * $b ;
        break;
    case '%':
        echo '$a '.$operator.' $b = ', $a % $b ;
        break;
    default:
        echo 'Вы ввели неправильный оператор';
        break;
}
?>